In [3]:
import pandas as pd

df=pd.read_csv("raw_data.csv")

In [5]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [7]:
df2=df.copy()

In [9]:
df2["tax"]=df2["income"].apply(lambda x:"20%" if x>=50000 else "10%")
df2

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  20%
1    1      John Doe  29.0     USA     Male  55000.0  20%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  20%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  20%

In [11]:
gender_map={
    "Male":"M",
    "Female":"F",
    "Unknown":"U"
}
df2["gender"]=df2["gender"].map(gender_map)

In [13]:
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

In [19]:
df2["new_income"]=df2["income"]*1.1

In [20]:
df2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
1    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%     63800.0

In [22]:
df2.assign(new_income=df2["income"]*1.1)

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
1    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%     63800.0

In [25]:
df2["country"]=df2["country"].replace("China","Nepal")

In [27]:
df2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
1    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   Nepal      M  51000.0  20%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%     63800.0

In [32]:
df.columns=["ID","NAME","AGE","COUNTRY","GENDER","INCOME"]
df

    ID          NAME   AGE COUNTRY   GENDER   INCOME
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [42]:
df.rename(columns={"INCOME":"salary"})

    ID          NAME   AGE COUNTRY   GENDER   salary
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [53]:
sorted_df=df2.sort_values(["income"])
sorted_df

sorted_df.sort_index()


sorted_df.reset_index()
sorted_df.reset_index(drop=True)

    id          name   age country gender   income  tax  new_income
0    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
1    3          Alex   NaN     USA      U  47000.0  10%     51700.0
2    5        Li Wei  27.0   Nepal      M  51000.0  20%     56100.0
3    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
4    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
5   10   Emily Davis  31.0     USA    NaN  58000.0  20%     63800.0
6    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
7    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0
8    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
9    6           NaN  45.0   India      F  73000.0  20%     80300.0
10   4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN

In [57]:
#ranking
sorted_df["ranking"]=sorted_df["age"].rank()
sorted_df

    id          name   age country gender   income  tax  new_income  ranking
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0      NaN
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0      NaN
5    5        Li Wei  27.0   Nepal      M  51000.0  20%     56100.0      1.0
1    1      John Doe  29.0     USA      M  55000.0  20%     60500.0      3.0
0    1      John Doe  29.0     USA      M  55000.0  20%     60500.0      3.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%     63800.0      5.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0      NaN
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0      3.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0      7.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0      8.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN      6.0

In [59]:
sorted_df["ranking"]=sorted_df["income"].rank(method="dense")
sorted_df

    id          name   age country gender   income  tax  new_income  ranking
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0      1.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0      2.0
5    5        Li Wei  27.0   Nepal      M  51000.0  20%     56100.0      3.0
1    1      John Doe  29.0     USA      M  55000.0  20%     60500.0      4.0
0    1      John Doe  29.0     USA      M  55000.0  20%     60500.0      4.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%     63800.0      5.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0      6.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0      6.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0      7.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0      8.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN      NaN

In [61]:
#reorder columns
df.columns=["ID","NAME","AGE","COUNTRY","INCOME","GENDER"]
df

    ID          NAME   AGE COUNTRY   INCOME   GENDER
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [63]:
df

    ID          NAME   AGE COUNTRY   INCOME   GENDER
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [67]:
df2=df.copy()

df2.columns=["NAME","AGE","COUNTRY","INCOME","GENDER","ID"]
df2

    NAME           AGE  COUNTRY  INCOME   GENDER       ID
0      1      John Doe     29.0     USA     Male  55000.0
1      1      John Doe     29.0     USA     Male  55000.0
2      2    Jane Smith      NaN  Canada   Female  62000.0
3      3          Alex      NaN     USA  Unknown  47000.0
4      4  Maria Garcia     34.0   Spain   Female      NaN
5      5        Li Wei     27.0   China     Male  51000.0
6      6           NaN     45.0   India   Female  73000.0
7      7    Ahmed Khan     38.0     NaN     Male  68000.0
8      8    Rachel Lee     29.0     USA   Female  62000.0
9      9   Carlos Ruiz      NaN  Mexico     Male  45000.0
10    10   Emily Davis     31.0     USA      NaN  58000.0